

var RegExpList =
[
    {
        id: 1,
        Reg: /^[0-9]+([.]{1}[0-9]{1,2})?$/,        
        msg:"请输入整数或者一位小数或两位小数",
        errmsg:"输入的格式不对，可以是整数也可以是一位小数或两位小数！"
    },
    {
        id: 2,
        Reg: /^[0-9a-zA-Z]+@[0-9a-zA-Z]+[\.]{1}[0-9a-zA-Z]+[\.]?[0-9a-zA-Z]+$/,
        msg:"请输入您的email",
        errmsg:"email格式不正确"
    }
    ,
    {
        id: 3,
        Reg: /^(\+86)?(1[0-9]{10})$/,
        msg:"请输入正确手机号",
        errmsg:"手机号不正确"
    }
    ,
    {
        id: 4,
        Reg: /^[1-9][0-9]{4,}$/,
        msg: "请输入QQ号码",
        errmsg: "QQ号码不正确"
    }
     ,
    {
        id: 5,
        Reg: /^(\w+):\/\/([^/:]+)(:\d*)?([^# ]*)$/,
        msg: "请输入网址，完整地址，如http://ebsite.cn ",
        errmsg: "输入的网址的格式不对"
    }    
         ,
    {
        id: 6,
        Reg: /^[1-9]\d*$/,
        msg: "请输入正整数",
        errmsg: "输入的正整数格式不对"
    }
    ,
    {
        id: 7,
        Reg: /^\d+\.\d+\.\d+\.\d+$/,
        msg: "请输入ip地址",
        errmsg: "输入的ip地址格式不对，请输入正确的ip地址"
    } 
         ,
    {
        id: 8,
        Reg: /^\d{15}|\d{18}$/,
        msg: "请输入身份证号",
        errmsg: "输入的身份证号不对,请输入正确的身份证号"
    } 
         ,
    {
        id: 9,
        Reg: /^[1-9]\d{5}(?!\d)$/,
        msg: "请输入中国邮政编码",
        errmsg: "输入的邮政编码格式不对,请输入中国邮政编码"
    }
          ,
    {
        id: 10,
        Reg: /^\d{3}-\d{7}|\d{3}-\d{8}|\d{4}-\d{7}|\d{4}-\d{8}$/,
        msg: "请输入国内电话号码+区号 如:010-1265689",
        errmsg: "输入的格式不对,请输入国内电话号码+区号 如:010-1265689"
    }
     ,
    {
        id: 11,
        Reg: /^[a-zA-Z][a-zA-Z0-9_]{2,15}$/,
        msg: "请输入由字母开头，允许3-16字的字符，允许字母数字下划线",
        errmsg: "输入的格式不对,请输入由字母开头，允许3-16字的字符，允许字母数字下划线"
    }   
    ,
    {
        id: 12,
        Reg: /^[1-9]\d*$/,
        msg: "请输入正整数",
        errmsg: "输入的格式不对，请输入正整数，如125"
    }  
     ,
    {
        id: 13,
        Reg: /^-[1-9]\d*$/,
        msg: "请输入负整数",
        errmsg: "输入的格式不对,请输入负整数,如-56"
    }  
     ,
    {
        id: 14,
        Reg: /^-?[0-9]\d*$/,
        msg: "请输入整数",
        errmsg: "输入的格式不对,请输入整数，可以是正整数也可以是负整数"
    }  
     ,
    {
        id: 15,
        Reg: /^[1-9]\d*|0$/,
        msg: "请输入一个正整数，可以是0",
        errmsg: "输入的格式不对,请输入一个正整数，可以是0,如:12"
    }  
     ,
    {
        id: 16,
        Reg: /^-[1-9]\d*|0$/,
        msg: "请输入一个负整数,可以是0",
        errmsg: "输入的格式不对,请输入一个负整数，可以是0,如:-12"
    }  
     ,
    {
        id: 17,
        Reg: /^[1-9]\d*\.\d*|0\.\d*[1-9]\d*$/,
        msg: "请输入一个正小数",
        errmsg: "输入的格式不对,请输入一个正小数,如:23.68"
    }  
     ,
    {
        id: 18,
        Reg: /^-([1-9]\d*\.\d*|0\.\d*[1-9]\d*)$/,
        msg: "请输入一个负小数",
        errmsg: "输入的格式不对,请输入一个负小数,如:-23.68"
    }  
     ,
    {
        id: 19,
        Reg: /^[A-Za-z]+$/,
        msg: "请输入英文字母,由a-Z组成,大小写都可以",
        errmsg: "输入的格式不对,请输入英文字母,由a-z组成,如:eBsite"
    }   
     ,
    {
        id: 20,
        Reg: /^[A-Z]+$/,
        msg: "请输入英文字母,由A-Z组成,注意只能输入大写",
        errmsg: "输入的格式不对,请输入英文字母,由A-Z组成,注意只能输入大写,如:EBSITE"
    }   
     ,
    {
        id: 21,
        Reg: /^[a-z]+$/,
        msg: "请输入英文字母,由a-z组成,注意只能输入小写",
        errmsg: "输入的格式不对,请输入英文字母,由a-z组成,注意只能输入小写,如:ebsite"
    }   
     ,
    {
        id: 22,
        Reg: /^[A-Za-z0-9]+$/,
        msg: "请输入由英文字母与数字组合的字符,注意第一个字符不能为数字",
        errmsg: "输入的格式不对,请输入由英文字母与数字组合的字符,注意第一个字符不能为数字,如:eBsite123"
    }   
     ,
    {
        id: 23,
        Reg: /^\w+$/,
        msg: "请输入数字、26个英文字母或者下划线组成的字符串",
        errmsg: "输入的格式不对,请输入数字、26个英文字母或者下划线组成的字符串,如:eBsite_123"
    }   
     ,
    {
        id: 24,
        Reg: /^[1-2][0-9][0-9][0-9]-[0-1]{0,1}[0-9]-[0-3]{0,1}[0-9]$/,
        msg: "请输入日期,格式为yyyy-mm-dd 如 2010-10-18",
        errmsg: "日期格式不正确，请输入正确的日期格式 如 2010-10-18"
    }   
      ,
    {
        id: 25,
        Reg: /^[^<>&/'\|\\]+$/,
        msg: "这里不能输入特殊字符,如 ' < > & 等",
        errmsg: "输入的内容不能包含特殊字符"
    }   
];